tsung_logs/tsung_new_user_pre_optimization/tsung_signup.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="test.eba-p7hsp2c9.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="9" duration="5" unit="second">
      <users arrivalrate="256" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="10" duration="5" unit="second">
      <users arrivalrate="512" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
    <option name="file_server" id="new_users" value="new_users.txt"/>
  </options>

  <sessions>
    <session name="signup-flow" type="ts_http" weight="1">
      <setdynvars sourcetype="file" fileid="new_users" delimiter="," order="iter">
        <var name="username"/>
        <var name="password"/>
      </setdynvars>

      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->         io:format([126, $p, 126, $n, 126, $n], [DynVars]),         ok end.">
        <var name="dump"/>
      </setdynvars>

      <request>
        <http method="GET" url="/"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http method="GET" url="/login"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/signup" version="1.1" method="POST" contents="user[username]=%%_username%%&amp;user[password]=%%_password%%" content_type="application/x-www-form-urlencoded">
        </http>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/login" version="1.1" method="POST" contents="username=%%_username%%&amp;password=%%_password%%" content_type="application/x-www-form-urlencoded">
        </http>
      </request>

      <thinktime value="2" random="true"/>
      
      <request>
        <http method="GET" url="/events/1"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http method="GET" url="/"/>
      </request>

      <request>
        <http method="GET" url="/posts/1"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http method="GET" url="/"/>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http method="DELETE" url="/logout"/>
      </request>

    </session>
  </sessions>
</tsung>